// Вывести квадрат числа

Console.WriteLine("Введите число: ");
int value = Convert.ToInt32(Console.ReadLine());


Console.Write(value * value);