// Написать программу вычисления значения функции y = f(a)

Console.WriteLine("Введите число (a)");
int a = Convert.ToInt32(Console.ReadLine());
int y = a * a;
Console.WriteLine($"{y} = f({a})");

